In [1]:
import pandas as pd

var = pd.DataFrame({"A": [1,2,3,4], "B": [5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [4]:
var["C"] = var["A"] - var["B"]

In [5]:
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [6]:
var["C"] = var["A"] * var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [8]:
var2 = pd.DataFrame({"A": [10,20,30,40], "B": [5,6,7,8]})
var2["Less than or equal to 20 in A"] = var2["A"] <= 20
var2["Greater than or equal to 6 in B"] = var2["B"] >= 6
var2

    A  B  Less than or equal to 20 in A  Greater than or equal to 6 in B
0  10  5                           True                            False
1  20  6                           True                             True
2  30  7                          False                             True
3  40  8                          False                             True